<a href="https://colab.research.google.com/github/brendanpshea/database_class/blob/main/Exam_2_SQL_Problems.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Exam 2 Problems
This notebook provides you a workspace to work on your exam 2 problems.  You should submit as part of your exam by downloading it as a .ipynb file.

You should ALSO include the text of your queries in the exam itself.

You can find a specification of the problems on the exam assignment.

---

#Set Up: Run the cells below
The following two cells  will get the Movie database set up. After you've run these cells (by hitting Ctrl + Enter), you should see the relational schema for each of the Movie databse tables.

Note: The first time you run these cells, it may take a minute or two!

In [ ]:
# Some UNIX utilites we need to install for the lab.
!pip install wget --quiet
!pip install sqlalchemy --quiet
!pip install ipython-sql --quiet

# Now let's download the file we'll be using for this lab
!wget 'https://github.com/brendanpshea/database_class/raw/main/movie.sqlite' -q

# Let's make a connnection with the database
%load_ext sql
%sql sqlite:////content/movie.sqlite

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

'Connected: @/content/movie.sqlite'

In [ ]:
# Get the schema
%%sql 
SELECT name AS "Table Name", sql AS "Schema of Table" FROM sqlite_master WHERE type = 'table';

 * sqlite:////content/movie.sqlite
Done.

[('Movie', 'CREATE TABLE Movie (id CHAR(7) PRIMARY KEY, name VARCHAR(64), year INTEGER, rating VARCHAR(5), runtime INTEGER, genre VARCHAR(16), earnings_rank INTEGER)'),
 ('Person', 'CREATE TABLE Person (id CHAR(7) PRIMARY KEY, name VARCHAR(64), dob DATE, pob VARCHAR(128))'),
 ('Actor', 'CREATE TABLE Actor (actor_id CHAR(7), movie_id CHAR(7), PRIMARY KEY (actor_id, movie_id), FOREIGN KEY (actor_id) REFERENCES Person(id), FOREIGN KEY (movie_id) REFERENCES Movie(id))'),
 ('Director', 'CREATE TABLE Director(director_id CHAR(7), movie_id CHAR(7), PRIMARY KEY (director_id, movie_id), FOREIGN KEY (director_id) REFERENCES Person(id), FOREIGN KEY (movie_id) REFERENCES Movie(id))'),
 ('Oscar', 'CREATE TABLE Oscar(movie_id CHAR(7), person_id CHAR(7), type VARCHAR(23), year INTEGER, PRIMARY KEY (person_id, type, year), FOREIGN KEY (movie_id) REFERENCES Movie(id), FOREIGN KEY (person_id) REFERENCES Person(id)\n)')]

In [ ]:
# Show the first 5 rows of each table
movie_df = %sql SELECT * FROM Movie LIMIT 5;
person_df = %sql SELECT * FROM Person LIMIT 5;
actor_df = %sql SELECT * FROM Actor LIMIT 5;
director_df = %sql SELECT * FROM Director LIMIT 5;
oscar_df = %sql SELECT * FROM Oscar LIMIT 5;
print(movie_df,'\n\n',person_df, '\n\n', actor_df, '\n\n', director_df, '\n\n', oscar_df)

 * sqlite:////content/movie.sqlite
Done.
 * sqlite:////content/movie.sqlite
Done.
 * sqlite:////content/movie.sqlite
Done.
 * sqlite:////content/movie.sqlite
Done.
 * sqlite:////content/movie.sqlite
Done.
+---------+------------------------------+------+--------+---------+-------+---------------+
|    id   |             name             | year | rating | runtime | genre | earnings_rank |
+---------+------------------------------+------+--------+---------+-------+---------------+
| 2488496 | Star Wars: The Force Awakens | 2015 | PG-13  |   138   |   A   |       1       |
| 4154796 |      Avengers: Endgame       | 2019 | PG-13  |   181   |  AVS  |       2       |
| 0499549 |            Avatar            | 2009 | PG-13  |   162   |  AVYS |       3       |
| 1825683 |        Black Panther         | 2018 | PG-13  |   134   |  AVS  |       4       |
| 4154756 |    Avengers: Infinity War    | 2018 | PG-13  |   149   |  AVYS |       5       |
+---------+------------------------------+------+--------+---------+-------+---------------+

 +---------+-----------------+------------+-------------------------+
|    id   |       name      |    dob     |           pob           |
+---------+-----------------+------------+-------------------------+
| 0000002 |  Lauren Bacall  | 1924-09-16 | New York, New York, USA |
| 0000004 |   John Belushi  | 1949-01-24 |  Chicago, Illinois, USA |
| 0000006 |  Ingrid Bergman | 1915-08-29 |    Stockholm, Sweden    |
| 0000007 | Humphrey Bogart | 1899-12-25 | New York, New York, USA |
| 0000008 |  Marlon Brando  | 1924-04-03 |   Omaha, Nebraska, USA  |
+---------+-----------------+------------+-------------------------+

 +----------+----------+
| actor_id | movie_id |
+----------+----------+
| 0000138  | 0120338  |
| 0000701  | 0120338  |
| 0000708  | 0120338  |
| 0000870  | 0120338  |
| 0000200  | 0120338  |
+----------+----------+

 +-------------+----------+
| director_id | movie_id |
+-------------+----------+
|   0000116   | 0120338  |
|   0000184   | 0076759  |
|   0011470   | 0298148  |
|   0000229   | 0083866  |
|   0000184   | 0120915  |
+-------------+----------+

 +----------+-----------+-------------------------+------+
| movie_id | person_id |           type          | year |
+----------+-----------+-------------------------+------+
| 6751668  |    None   |       BEST-PICTURE      | 2020 |
| 7286456  |  0001618  |        BEST-ACTOR       | 2020 |
| 7549996  |  0000250  |       BEST-ACTRESS      | 2020 |
| 7131622  |  0000093  |  BEST-SUPPORTING-ACTOR  | 2020 |
| 7653254  |  0000368  | BEST-SUPPORTING-ACTRESS | 2020 |
+----------+-----------+-------------------------+------+

#Exam Problems

In [ ]:
## Problem 11
%%sql 
-- Your code here

In [ ]:
## Problem 12
%%sql
-- Your code here

In [ ]:
## Problem 13
%%sql
-- Your code here

In [ ]:
## Problem 14
%%sql
-- Your code here

In [ ]:
## Problem 15
%%sql
-- Your code here

In [ ]:
## Problem 16
%%sql
-- Your code here

In [ ]:
## Problem 17
%%sql
-- Your code here

In [ ]:
## Problem 18
%%sql
-- Your code here

In [ ]:
## Problem 19
%%sql
-- Your code here

In [ ]:
## Problem 20
%%sql
-- Your code here